"""
Реализовать функцию, принимающую два числа
(позиционные аргументы) и выполняющую их деление.
Числа запрашивать у пользователя,
предусмотреть обработку ситуации деления на ноль.
"""


def div(*args):
    try:
        arg1 = int(input("Введите первое число "))
        arg2 = int(input("Введите второе число "))
        res = arg1 / arg2
    except ValueError:
        return 'Введено не число'
    except ZeroDivisionError:
        return "Деление на 0 запрещено!"

    return res


print(f'Результат = {div()}')
